
## Plan Result

[CI link](https://github.com/goda6565/portfolio/actions/runs/15128867711)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger will be created
  + resource "google_cloudbuild_trigger" "github_trigger" {
      + create_time        = (known after apply)
      + description        = "Build trigger for frontend"
      + filename           = "manifests/cloudbuild/frontend.yaml"
      + id                 = (known after apply)
      + include_build_logs = "INCLUDE_BUILD_LOGS_WITH_STATUS"
      + included_files     = [
          + "apps/frontend/**",
        ]
      + location           = "us-west2"
      + name               = "frontend-trigger"
      + project            = "portfolio-460206"
      + service_account    = "projects/portfolio-460206/serviceAccounts/cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + trigger_id         = (known after apply)

      + approval_config (known after apply)

      + repository_event_config {
          + repository = "projects/portfolio-460206/locations/us-west2/connections/github-connection/repositories/portfolio"

          + push {
              + branch = "^(main|feat/.*)$"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label add-or-update: POST https://api.github.com/repos/goda6565/portfolio/issues/29/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":29,"Program":"tfcmt","SHA1":"3e7ec8c374d5fe86d67fe76b690d5df8cf96b3ed","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->